---
kind: method
id: M:Autodesk.Revit.DB.Architecture.StairsLanding.GetFootprintBoundary
source: html/d034d8f7-2125-5013-67ed-fce94c280afa.htm
---
# Autodesk.Revit.DB.Architecture.StairsLanding.GetFootprintBoundary Method

Returns the landing's boundary curves which are projected on the stairs base level.

## Syntax (C#)
```csharp
public CurveLoop GetFootprintBoundary()
```

## Returns
The boundary curves of the landing.